In [1]:
import pandas as pd

In [7]:
tables = pd.read_html("https://www.w3schools.com/html/html_tables.asp")

In [8]:
tables

[                        Company           Contact  Country
 0           Alfreds Futterkiste      Maria Anders  Germany
 1    Centro comercial Moctezuma   Francisco Chang   Mexico
 2                  Ernst Handel     Roland Mendel  Austria
 3                Island Trading     Helen Bennett       UK
 4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
 5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy,
           Tag                                        Description
 0     <table>                                    Defines a table
 1        <th>                   Defines a header cell in a table
 2        <tr>                           Defines a row in a table
 3        <td>                          Defines a cell in a table
 4   <caption>                            Defines a table caption
 5  <colgroup>  Specifies a group of one or more columns in a ...
 6       <col>  Specifies column properties for each column wi...
 7     <thead>               Groups the header content in a table
 8     <tbody>                 Groups the body content in a table
 9     <tfoot>               Groups the footer content in a table]

In [3]:
type(tables[0])

pandas.core.frame.DataFrame

In [5]:
table = tables[0]

In [6]:
table

                        Company           Contact  Country
0           Alfreds Futterkiste      Maria Anders  Germany
1    Centro comercial Moctezuma   Francisco Chang   Mexico
2                  Ernst Handel     Roland Mendel  Austria
3                Island Trading     Helen Bennett       UK
4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy

In [9]:
table.to_excel("info.xlsx")

In [10]:
names=["AYUSHI","RAJESH","PRITI"]

In [11]:
age=[20,55,46]

In [12]:
s_name=pd.Series(names)
s_age=pd.Series(age)

In [19]:
pd.DataFrame([s_name,s_age])

        0       1      2
0  AYUSHI  RAJESH  PRITI
1      20      55     46

In [20]:
pd.DataFrame([s_name,s_age]).T

        0   1
0  AYUSHI  20
1  RAJESH  55
2   PRITI  46

In [21]:
pd.DataFrame({"names":s_name,"age":s_age})

   age   names
0   20  AYUSHI
1   55  RAJESH
2   46   PRITI